[{"book_name": "Microsoft Dynamics 365 For Dummies", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Microsoft-Dynamics-365-For-Dummies.jpg", "book_author": " Renato Bellu", "book_info": "Accelerate your digital transformation and break down silos with Microsoft Dynamics 365 It’s no secret that running a business involves several complex parts like managing staff, financials, marketing, and operations—just to name a few. That’s where Microsoft Dynamics 365, the most profitable business management tool, comes in. In Microsoft…"}, {"book_name": "Android Phones & Tablets For Dummies", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Android-Phones-Tablets-For-Dummies.jpg", "book_author": " Dan Gookin", "book_info": "Outsmart your new Android Getting a smartphone or tablet can be intimidating for anyone, but this user-friendly guide is here to help you to get the most out of all your new gadget has to offer! Whether you’re upgrading from an older model or totally new to the…"}, {"book_name": "CCNA Security 640-554 Official Cert Guide", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/CCNA-Security-640-554-Official-Cert-Guide.jpg", "book_author": " Keith Barker, Scott Morris", "book_info": "Trust the best selling Official Cert Guide series from Cisco Press to help you learn, prepare, and practice for exam success. They are built with the objective of providing assessment, review, and practice to help ensure you are fully prepared for your certification exam. CCNA Security 640-554 Official…"}, {"book_name": "Applied WPF 4 in Context", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Applied-WPF-4-in-Context.jpg", "book_author": " Raffaele Garofalo", "book_info": "Applied WPF 4 in Context sets the standard for leveraging the latest Windows user interface technology in your business applications. Using this book, you’ll learn how to implement world-class Windows Professional Foundation (WPF) solutions in a real-world line of business applications, developing the code from the ground up, and understand…"}, {"book_name": "Ajax Patterns and Best Practices", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Ajax-Patterns-and-Best-Practices.jpg", "book_author": " Christian Gross", "book_info": "Takes a unique angle on Ajax, providing patterns for application development and best practices for integrating Ajax and REST into rich applications Designed to suit all groups of developers across many platforms, who are interested in the hot new topic of Ajax High demand for Ajax knowledge. Leading…"}, {"book_name": "Testing and Tuning Market Trading Systems", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Testing-and-Tuning-Market-Trading-Systems-Algorithms-in-C.jpg", "book_author": " Timothy Masters", "book_info": "Build, test, and tune financial, insurance or other market trading systems using C++ algorithms and statistics. You’ve had an idea and have done some preliminary experiments, and it looks promising. Where do you go from here?  Well, this book discusses and dissects this case study approach. Seemingly good…"}, {"book_name": "Final Cut Pro X Cookbook", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Final-Cut-Pro-X-Cookbook-400x493.jpg", "book_author": " Cox Jason", "book_info": "As technology becomes more and more accessible and easier to use, we are expected to do more in less time than ever before. Video editors are now expected to be able not only to edit, but create motion graphics, fix sound issues, enhance image quality and color and…"}, {"book_name": "Windows Server 2012", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Windows-Server-2012.jpg", "book_author": " Samara Lynn", "book_info": "If your organization plans to move to a cloud infrastructure from a LAN or WAN, this book shows you how to do it efficiently with Windows Server 2012. Experienced Windows administrators will learn how to deploy, configure, and manage the server’s expanded capabilities and features step-by-step, using clear…"}, {"book_name": "Mastering 3D Printing in the Classroom, Library, and Lab", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Mastering-3D-Printing-in-the-Classroom-Library-and-Lab.jpg", "book_author": " Joan Horvath, Rich Cameron", "book_info": "Learn how to manage and integrate the technology of 3D printers in the classroom, library, and lab. With this book, the authors give practical, lessons-learned advice about the nuts and bolts of what happens when you mix 3D printers, teachers, students, and the general public in environments ranging…"}, {"book_name": "Mastering Jenkins", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Mastering-Jenkins-400x493.jpg", "book_author": " Jonathan McAllister", "book_info": "With the software industry becoming more and more competitive, organizations are now integrating delivery automation and automated quality assurance practices into their business model. Jenkins represents a complete automation orchestration system, and can help converge once segregated groups into a cohesive product development and delivery team. By mastering…"}, {"book_name": "Access 2019 For Dummies", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Access-2019-For-Dummies.jpg", "book_author": " Ken Cook, Laurie A. Ulrich", "book_info": "Easy steps to practical databases People who really know how to build, populate, and simplify databases are few and far between. Access 2019 For Dummies is here to help you join the ranks of office heroes who possess these precious skills. This book offers clear and simple advice on how…"}, {"book_name": "Learning Perl 6", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Learning-Perl-6.jpg", "book_author": " brian d foy", "book_info": "If you’re ready to get started with Perl 6, this is the book you want, whether you’re a programmer, system administrator, or web hacker. Perl 6 is a new language—a modern reinvention of Perl suitable for almost any task, from short fixes to complete web applications. This hands-on…"}, {"book_name": "Electron in Action", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Electron-in-Action.jpg", "book_author": " Steve Kinney", "book_info": "Electron in Action guides you, step-by-step, as you learn to build cross-platform desktop applications that run on Windows, OSX, and Linux. By the end of the book, you’ll be ready to build simple, snappy applications using JavaScript, Node, and the Electron framework."}, {"book_name": "Microservices in Action", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Morgan-Bruce.jpg", "book_author": " Morgan Bruce, Paulo A. Pereira", "book_info": "Microservices in Action is a practical book about building and deploying microservice-based applications. Written for developers and architects with a solid grasp of service-oriented development, it tackles the challenge of putting microservices into production."}, {"book_name": "Spring in Action, 5th Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Spring-in-Action-5th-Edition.jpg", "book_author": " Craig Walls", "book_info": "Spring in Action, 5th Edition is the fully updated revision of Manning’s bestselling Spring in Action. This new edition includes all Spring 5.0 updates, along with new examples on reactive programming, Spring WebFlux, and microservices. You’ll also find the latest Spring best practices, including Spring Boot for application setup…"}, {"book_name": "YouTube Channels For Dummies", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/YouTube-Channels-For-Dummies-400x493.jpg", "book_author": " Adam Wescott, John Carucci, Rob Ciampa, Stan Muller, Theresa Moore", "book_info": "Create content and build a YouTube channel like a pro Written by a successful YouTube channel producer, YouTubeChannels For Dummies shows you how to create content, establisha channel, build an audience, and successfully monetize videocontent online. Beginning with the basics, it shows you how toestablish a channel, join a partner…"}, {"book_name": "Photoshop Elements 2018 For Dummies", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Photoshop-Elements-2018-For-Dummies-400x498.jpg", "book_author": " Barbara Obermeier, Ted Padova", "book_info": "The top-selling book on Photoshop Elements—updated in a new edition Photoshop Elements offers photo editors of all skill levels the power to turn run-of-the-mill images into beautiful works of art—and Photoshop Elements 2018 For Dummies shows you how. Those new to photo editing who are looking for advice on making…"}, {"book_name": "Yammer: Collaborate, Connect, and Share", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Yammer-Collaborate-Connect-and-Share.jpg", "book_author": " Charles Waghmare", "book_info": "Build a successful Yammer implementation, make your workplace social and collaborative, create a culture of sharing, form expert communities and generate innovative solutions. Besides, this book will help to enhance your collaboration your suppliers, partners, and clients. The author starts by giving an introduction to social collaborations and…"}, {"book_name": "Deploying Chromebooks in the Classroom", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Deploying-Chromebooks-in-the-Classroom.jpg", "book_author": " Guy Hart-Davis", "book_info": "Learn how to deploy Chromebook computers in a classroom or lab situation and how to navigate the hardware and software choices you face. This book equips you with the skills and knowledge to plan and execute a deployment of Chromebook computers in the classroom.  Teachers and IT administrators at…"}, {"book_name": "Getting to Know Vue.js", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Getting-to-Know-Vuejs.jpg", "book_author": " Brett Nelson", "book_info": "Learn how to render lists of items without repeating your code structure and how to work with conditional rendering items and event handling. Containing all you need to know to get started with Vue.js, this book will take you through using build tools (transpile to ES5), creating custom…"}, {"book_name": "Dart in Action", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Dart-in-Action.jpg", "book_author": " Chris Buckett", "book_info": "Dart in Action introduces Google’s Dart language and provides techniques and examples showing how to use it as a viable replacement for Java and JavaScript in browser-based desktop and mobile applications. It begins with a rapid overview of Dart language and tools, including features like interacting with the browser,…"}, {"book_name": "Mastering Azure Analytics", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Mastering-Azure-Analytics.jpg", "book_author": " Zoiner Tejada", "book_info": "Microsoft Azure has over 20 platform-as-a-service (PaaS) offerings that can act in support of a big data analytics solution. So which one is right for your project? This practical book helps you understand the breadth of Azure services by organizing them into a reference framework you can use…"}, {"book_name": "Vue.js: Up and Running", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Vue.js-Up-and-Running.jpg", "book_author": " Callum Macrae", "book_info": "Get a brisk introduction to building fast, interactive single-page web applications with Vue.js, the popular JavaScript framework that organizes and simplifies web development. With this practical guide, you’ll quickly move from basics to custom components and advanced features—including JSX, the JavaScript syntax extension. Author Callum Macrae shows you…"}, {"book_name": "Excel 2019 For Dummies", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Excel-2019-For-Dummies.jpg", "book_author": " Greg Harvey", "book_info": "The bestselling Excel book on the market — now in a new edition covering the latest version of Excel! Excel is the spreadsheet and data analysis tool of choice for people across the globe who utilize the Microsoft Office suite to make their work and personal lives easier…."}, {"book_name": "Practical SharePoint 2013 Governance", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Practical-SharePoint-2013-Governance-400x494.jpg", "book_author": " Steve Goodyear", "book_info": "Practical SharePoint 2013 Governance is the first book to offer practical and action-focused SharePoint governance guidance based on consulting experiences with real organizations in the field. It provides the quintessential governance reference guide for SharePoint consultants, administrators, architects, and anyone else looking for actual hands-on governance guidance. This book…"}, {"book_name": "CWTS, 2nd Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/CWTS-2nd-Edition.jpg", "book_author": " Robert J. Bartz", "book_info": "Pass the CWTS exam with the help of this fully updated officialguide Completely updated to cover the latest Certified WirelessTechnology Specialist exam, this best-selling guide is the onlyOfficial Study Guide for the popular wireless certification. Thisfoundation-level certification is in high demand for wirelessnetworking professionals, and you can master…"}, {"book_name": "Windows Store App Development", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Windows-Store-App-Development.jpg", "book_author": " Pete Brown", "book_info": "Windows Store App Development introduces C# developers to working with Windows Store apps. It provides full coverage of XAML, and addresses both app design and development. Following numerous carefully crafted examples, you’ll learn about new Windows 8 features, the WinRT API, and .NET 4.5. Along the way, you’ll pick…"}, {"book_name": "Building Your Online Store With WordPress and WooCommerce", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Building-Your-Online-Store-With-WordPress-and-WooCommerce1.jpg", "book_author": " Lisa Sims", "book_info": "Teaches you all about e-commerce and how to create your own online shop using WordPress and WooCommerce. Regardless of a business’s size, e-commerce helps level the playing field, increases a business’s exposure, allows companies to reach customers globally, and streamlines the fulfillment process. In the past, e-commerce websites…"}, {"book_name": "WordPress All-in-One For Dummies, 3rd Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/WordPress-All-in-One-For-Dummies-3rd-Edition.jpg", "book_author": " Lisa Sabin-Wilson", "book_info": "Everything you need to know about WordPress If you strive to have a blog that suits your needs, delights your readers, and keeps visitors coming back for more, this book is your ace in the hole! Offering you cream-of-the-crop guidance from eight bestselling books, WordPress All-in-One For Dummies is the…"}, {"book_name": "Software Development From A to Z", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Software-Development-From-A-to-Z.jpg", "book_author": " Olga Filipova, Rui Vilão", "book_info": "Understand the big picture of the software development process. We use software every day – operating systems, applications, document editing programs, home banking – but have you ever wondered who creates software and how it’s created? This book guides you through the entire process, from conception to the…"}, {"book_name": "Practical TLA+", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Practical-TLA-.jpg", "book_author": " Hillel Wayne", "book_info": "Learn how to design complex, correct programs and fix problems before writing a single line of code. This book is a practical, comprehensive resource on TLA+ programming with rich, complex examples. Practical TLA+ shows you how to use TLA+ to specify a complex system and test the design itself for…"}, {"book_name": "3D Printing For Dummies, 2nd Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/3D-Printing-For-Dummies-2nd-Edition.jpg", "book_author": " Kalani Kirk Hausman, Richard Horne", "book_info": "The bestselling book on 3D printing 3D printing is one of the coolest inventions we’ve seen in our lifetime, and now you can join the ranks of businesspeople, entrepreneurs, and hobbyists who use it to do everything from printing foods and candles to replacement parts for older technologies—and…"}, {"book_name": "Pro Netbeans IDE 6 Rich Client Platform Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Pro-Netbeans-IDE-6-Rich-Client-Platform-Edition.jpg", "book_author": " Adam Myatt", "book_info": "This book will enable you to rapidly develop Java front ends of applications using API buttons, functions, and features mostly based in the Java SE 6 platform. It covers working with rich client platform features available in NetBeans for building web-based application front ends. The book also shows…"}, {"book_name": "PHP, MySQL, JavaScript & HTML5 All-in-One For Dummies", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/PHP-MySQL-JavaScript-HTML5-All-in-One-For-Dummies.jpg", "book_author": " Janet Valade, Steve Suehring", "book_info": "Get the basics on four key web programming tools in one great book! PHP, JavaScript, and HTML5 are essential programming languages for creating dynamic websites that work with the MySQL database. PHP and MySQL provide a robust, easy-to-learn, open-source solution for creating superb e-commerce sites and content management…."}, {"book_name": "Pro Angular 6, 3rd Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Pro-Angular-6-3rd-Edition.jpg", "book_author": " Adam Freeman", "book_info": "Get the most from Angular 6, the leading framework for building dynamic JavaScript applications. Understand the MVC pattern and the benefits it can offer. Best-selling author Adam Freeman shows you how to use Angular in your projects, starting from the nuts and bolts and building up to the most advanced…"}, {"book_name": "Expert SQL Server Transactions and Locking", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Expert-SQL-Server-Transactions-and-Locking.jpg", "book_author": " Dmitri Korotkevitch", "book_info": "Master SQL Server’s Concurrency Model so you can implement high-throughput systems that deliver transactional consistency to your application customers. This book explains how to troubleshoot and address blocking problems and deadlocks, and write code and design database schemas to minimize concurrency issues in the systems you develop. SQL…"}, {"book_name": "Python Descriptors, 2nd Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Python-Descriptors.jpg", "book_author": " Jacob Zimmerman", "book_info": "Create descriptors and see ideas and examples of how to use descriptors effectively. In this short book, you’ll explore descriptors in general, with a deep explanation of what descriptors are, how they work, and how they’re used. Once you understand the simplicity of the descriptor protocol, the author…"}, {"book_name": "Excel 2019 Bible", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Excel-2019-Bible.jpg", "book_author": " John Walkenbach, Michael Alexander, Richard Kusleika", "book_info": "The complete guide to Excel 2019 Whether you are just starting out or an Excel novice, the Excel 2019 Bible is your comprehensive, go-to guide for all your Excel 2019 needs. Whether you use Excel at work or at home, you will be guided through the powerful new features and…"}, {"book_name": "Oracle Big Data Handbook", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Oracle-Big-Data-Handbook-400x495.jpg", "book_author": " Brian MacDonald, Bruce Nelson, David Segleau, Debra Harding, Gokula Mishra, Helen Sun, Keith Laker, Khader Mohiuddin, Mark Hornick, Robert Stackowiak, Tom Plunkett", "book_info": "Transform Big Data into Insight “In this book, some of Oracle’s best engineers and architects explain how you can make use of big data. They’ll tell you how you can integrate your existing Oracle solutions with big data systems, using each where appropriate and moving data between them…"}, {"book_name": "IP Multicast, Volume II", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/IP-Multicast-Volume-II-400x498.jpg", "book_author": " Arvind Durai, Josh Loveless, Ray Blair", "book_info": "Design, operate, and troubleshoot advanced Cisco IP multicast in enterprise, data center, and service provider networks IP Multicast, Volume II thoroughly covers advanced IP multicast designs and protocols specific to Cisco routers and switches. It offers a pragmatic discussion of common features, deployment models, and field practices for…"}, {"book_name": "Adobe Creative Suite 5 Bible", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Adobe-Creative-Suite-5-Bible.jpg", "book_author": " Kelly L. Murdock, Ted Padova", "book_info": "Learn to use CS5 to produce better work and become a more productive designer The newest release of Adobe Creative Suite boasts a world of must-have features and enhancements to each of its applications: Photoshop, Illustrator, InDesign, GoLive, Acrobat, and Version Cue. Written by a duo of Adobe…"}, {"book_name": "Photoshop Lightroom 3", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Photoshop-Lightroom-3.jpg", "book_author": " Nolan Hester", "book_info": "This book uses simple step-by-step instructions, loads of screen shots, and an array of time-saving tips and tricks, serving both as the quickest route to Adobe Photoshop Lightroom 3 mastery for new users, and a handy reference for more experienced digital photographers. Adobe Photoshop Lightroom 3 was designed…"}, {"book_name": "Practical Software Requirements", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Practical-Software-Requirements-400x493.jpg", "book_author": " Benjamin L Kovitz", "book_info": "This is a comprehensive guidebook for the programmer or manager writing requirements for the first time, as well as the experienced system analyst. The author takes a unique approach to the subject: that a useful requirements document derives from the techniques employed by programmers and interface designers. His…"}, {"book_name": "Personal Finance with Python", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Personal-Finance-with-Python.jpg", "book_author": " Max Humber", "book_info": "Deal with data, build up financial formulas in code from scratch, and evaluate and think about money in your day-to-day life. This book is about Python and personal finance and how you can effectively mix the two together. In Personal Finance with Python you will learn Python and finance at…"}, {"book_name": "Modern Java in Action, 2nd Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/Modern-Java-in-Action-2nd-Edition.jpg", "book_author": " Alan Mycroft, Mario Fusco, Raoul-Gabriel Urma", "book_info": "Manning’s bestselling Java 8 book has been revised for Java 9 and Java 10! In Modern Java in Action, readers build on their existing Java language skills with the newest features and techniques. The release of Java 9 builds on what made Java 8 so exciting. In addition to…"}, {"book_name": "CodeIgniter 1.7 professional development", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/10/CodeIgniter-1.7-professional-development-400x494.jpg", "book_author": " Adam Griffith", "book_info": "This book is a practical guide that takes you through a number of techniques. Each chapter builds upon knowledge from the previous chapter. Step-by-step instructions with examples and illustrative screenshots ensure that you gain a firm grasp of the topic being explained.This book is written for advanced PHP…"}, {"book_name": "Practical PHP 7, MySQL 8, and MariaDB Website Databases, 2nd Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Practical-PHP-7-MySQL-8-and-MariaDB-Website-Databases.jpg", "book_author": " Adrian W. West, Steve Prettyman", "book_info": "Build interactive, database-driven websites with PHP 7, MySQL 8, and MariaDB. The focus of this book is on getting you up and running as quickly as possible with real-world applications. In the first two chapters, you will set up your development and testing environment, and then build your…"}, {"book_name": "Python Data Analytics, 2nd Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Python-Data-Analytics-2nd-Edition.jpg", "book_author": " Fabio Nelli", "book_info": "Explore the latest Python tools and techniques to help you tackle the world of data acquisition and analysis. You’ll review scientific computing with NumPy, visualization with matplotlib, and machine learning with scikit-learn. This revision is fully updated with new content on social media data analysis, image analysis with…"}, {"book_name": "UX Optimization", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/UX-Optimization.jpg", "book_author": " W. Craig Tomlin", "book_info": "Combine two typically separate sources of data―behavioral quantitative data and usability testing qualitative data―into a powerful single tool that helps improve your organization’s website by increasing conversion and ROI. The combination of the what is happening data of website activity, coupled with the why it’s happening data of usability testing, provides a complete…"}, {"book_name": "Liferay Portal 6 Enterprise Intranets", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Liferay-Portal-6-Enterprise-Intranets-400x494.jpg", "book_author": " Jonas X. Yuan", "book_info": "This book is a practical guide with a very user-friendly approach. The author has taken a virtual enterprise as an example and has used the features of Liferay to build a corporate intranet for that enterprise. This book is for system administrators or experienced users (not necessarily programmers)…"}, {"book_name": "Privileged Attack Vectors", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Privileged-Attack-Vectors.jpg", "book_author": " Brad Hibbert, Morey J. Haber", "book_info": "See how privileges, passwords, vulnerabilities, and exploits can be combined as an attack vector and breach any organization. Cyber attacks continue to increase in volume and sophistication. It is not a matter of if, but when, your organization will be breached. Attackers target the perimeter network, but, in…"}, {"book_name": "Yammer", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Yammer.jpg", "book_author": " Charles Waghmare", "book_info": "Build a successful Yammer implementation, make your workplace social and collaborative, create a culture of sharing, form expert communities and generate innovative solutions. Besides, this book will help to enhance your collaboration your suppliers, partners, and clients. The author starts by giving an introduction to social collaborations and…"}, {"book_name": "Complete Guide to Test Automation", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Complete-Guide-to-Test-Automation.jpg", "book_author": " Arnon Axelrod", "book_info": "Rely on this robust and thorough guide to build and maintain successful test automation. As the software industry shifts from traditional waterfall paradigms into more agile ones, test automation becomes a highly important tool that allows your development teams to deliver software at an ever-increasing pace without compromising…"}, {"book_name": "CCSP Certified Cloud Security Professional All-in-One Exam Guide", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/CCSP-Certified-Cloud-Security-Professional-All-in-One-Exam-Guide.jpg", "book_author": " Daniel Carter", "book_info": "This self-study guide delivers 100% coverage of all topics on the new CCSP exam This highly effective test preparation guide covers all six domains within the CCSP Body of Knowledge, as established both by CSA and the (ISC)2. The book offers clear explanations of every subject on the…"}, {"book_name": "Cosmos DB for MongoDB Developers", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Cosmos-DB-for-MongoDB-Developers.jpg", "book_author": " Manish Sharma", "book_info": "Learn Azure Cosmos DB and its MongoDB API with hands-on samples and advanced features such as the multi-homing API, geo-replication, custom indexing, TTL, request units (RU), consistency levels, partitioning, and much more. Each chapter explains Azure Cosmos DB’s features and functionalities by comparing it to MongoDB with coding…"}, {"book_name": "Beginning AI Bot Frameworks", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Beginning-AI-Bot-Frameworks.jpg", "book_author": " Manisha Biswas", "book_info": "Want to build your first AI bot but don’t know where to start? This book provides a comprehensive look at all the major bot frameworks available. You’ll learn the basics for each framework in one place and get a clear picture for which one is best for your…"}, {"book_name": "Cybersecurity Incident Response", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Cybersecurity-Incident-Response.jpg", "book_author": " Eric C. Thompson", "book_info": "Create, maintain, and manage a continual cybersecurity incident response program using the practical steps presented in this book. Don’t allow your cybersecurity incident responses (IR) to fall short of the mark due to lack of planning, preparation, leadership, and management support. Surviving an incident, or a breach, requires…"}, {"book_name": "Advanced BlackBerry Development", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Advanced-BlackBerry-Development.jpg", "book_author": " Chris King", "book_info": "BlackBerry devices and applications are selling by the millions. As a BlackBerry developer, you need an advanced skill set to successfully exploit the most compelling features of the platform. This book will help you develop that skill set and teach you how to create the most sophisticated BlackBerry…"}, {"book_name": "Introducing Microsoft Flow", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Introducing-Microsoft-Flow.jpg", "book_author": " Vijai Anand Ramalingam", "book_info": "Use Microsoft Flow in your business to improve productivity through automation with this step-by-step introductory text from a Microsoft Flow expert. You’ll see the prerequisites to get started with this cloud-based service, including how to create a flow and how to use different connectors. Introducing Microsoft Flow takes you through…"}, {"book_name": "Troubleshooting and Maintaining Your PC All-in-One For Dummies, 3rd Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Troubleshooting-and-Maintaining-Your-PC-All-in-One-For-Dummies-3rd-Edition1.jpg", "book_author": " Dan Gookin", "book_info": "Stop being a prisoner to your PC! Need a PC problem fixed in a pinch? Presto! Troubleshooting & Maintaining Your PC All-in-One For Dummies offers 5 books in 1 and takes the pain out of wading through those incomprehensible manuals, or waiting for a high-priced geek to show up days…"}, {"book_name": "Hacking For Dummies, 6th Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Hacking-For-Dummies-6th-Edition.jpg", "book_author": " Kevin Beaver", "book_info": "Stop hackers before they hack you! In order to outsmart a would-be hacker, you need to get into the hacker’s mindset. And with this book, thinking like a bad guy has never been easier. In Hacking For Dummies, expert author Kevin Beaver shares his knowledge on penetration testing, vulnerability…"}, {"book_name": "Website Scraping with Python", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Website-Scraping-with-Python.jpg", "book_author": " Gábor László Hajba", "book_info": "Closely examine website scraping and data processing: the technique of extracting data from websites in a format suitable for further analysis. You’ll review which tools to use, and compare their features and efficiency. Focusing on BeautifulSoup4 and Scrapy, this concise, focused book highlights common problems and suggests solutions that…"}, {"book_name": "Designing Web APIs", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Designing-Web-APIs.jpg", "book_author": " Amir Shevat, Brenda Jin, Saurabh Sahni", "book_info": "Using a web API to provide services to application developers is one of the more satisfying endeavors that software engineers undertake. But building a popular API with a thriving developer ecosystem is also one of the most challenging. With this practical guide, developers, architects, and tech leads will…"}, {"book_name": "iPhone For Dummies, 11th Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/iPhone-For-Dummies-11th-Edition-400x498.jpg", "book_author": " Bob LeVitus, Edward C. Baig", "book_info": "The iPhone boot camp for getting the most out of your device iPhone For Dummies is the ultimate user-friendly guide to the iPhone! Whether you’re new to the iPhone or just want to get more out of it, this book will show you the essentials you need to know…"}, {"book_name": "Monetizing Machine Learning", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Monetizing-Machine-Learning.jpg", "book_author": " Manuel Amunategui, Mehdi Roopaei", "book_info": "Take your Python machine learning ideas and create serverless web applications accessible by anyone with an Internet connection. Some of the most popular serverless cloud providers are covered in this book―Amazon, Microsoft, Google, and PythonAnywhere. You will work through a series of common Python data science problems in…"}, {"book_name": "Pro Vue.js 2", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Pro-Vuejs-2.jpg", "book_author": " Adam Freeman", "book_info": "Explore Vue.js to take advantage of the capabilities of modern browsers and devices using the fastest-growing framework for building dynamic JavaScript applications. You will work with the power of the Model-View-Controller (MVC) pattern on the client, creating a strong foundation for complex and rich web apps. Best-selling author Adam…"}, {"book_name": "Applied Natural Language Processing with Python", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Applied-Natural-Language-Processing-with-Python.jpg", "book_author": " Taweh Beysolow II", "book_info": "Learn to harness the power of AI for natural language processing, performing tasks such as spell check, text summarization, document classification, and natural language generation. Along the way, you will learn the skills to implement these methods in larger infrastructures to replace existing code or create new algorithms…."}, {"book_name": "Beginning Reactive Programming with Swift", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Beginning-Reactive-Programming-with-Swift.jpg", "book_author": " Jesse Feiler", "book_info": "Learn the basics of reactive programming and how it makes apps more responsive. This book shows you how to incorporate reactive programming into existing development products and cycles using RXSwift and RXCocoa on iOS and Mac. As we move away from the traditional paradigm of typing or touching one step…"}, {"book_name": "Minecraft Recipes For Dummies", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Minecraft-Recipes-For-Dummies.jpg", "book_author": " Jesse Stay, Thomas Stay", "book_info": "A quick, handy reference on Minecraft recipes Want to find resources, make a shelter, craft tools, armor, and weapons, and protect yourself from monsters with Minecraft recipes? You’ve come to the right place! In a handy, portable edition that’s packed with step-by-step instructions, Minecraft Recipes For Dummies makes it easy…"}, {"book_name": "Visual Design of GraphQL Data", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Visual-Design-of-GraphQL-Data.jpg", "book_author": " Thomas Frisendal", "book_info": "Get an introduction to the visual design of GraphQL data and concepts, including GraphQL structures, semantics, and schemas in this compact, pragmatic book. In it you will see simple guidelines based on lessons learned from real-life data discovery and unification, as well as useful visualization techniques. These in…"}, {"book_name": "QuickBooks 2018 For Dummies", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/QuickBooks-2018-For-Dummies.jpg", "book_author": " Stephen L. Nelson", "book_info": "The perennial bestseller—now in a new edition for QuickBooks 2018 QuickBooks 2018 For Dummies is here to make it easier than ever to familiarize yourself with the latest version of the software. It shows you step by step how to build the perfect budget, simplify tax return preparation, manage…"}, {"book_name": "Applied Deep Learning", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Applied-Deep-Learning.jpg", "book_author": " Umberto Michelucci", "book_info": "Work with advanced topics in deep learning, such as optimization algorithms, hyper-parameter tuning, dropout, and error analysis as well as strategies to address typical problems encountered when training deep neural networks. You’ll begin by studying the activation functions mostly with a single neuron (ReLu, sigmoid, and Swish), seeing…"}, {"book_name": "Introducing InnoDB Cluster", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Introducing-InnoDB-Cluster.jpg", "book_author": " Charles Bell", "book_info": "Set up, manage, and configure the new InnoDB Cluster feature in MySQL from Oracle. If you are growing your MySQL installation and want to explore making your servers highly available, this book provides what you need to know about high availability and the new tools that are available…"}, {"book_name": "Beginning SVG", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Beginning-SVG.jpg", "book_author": " Alex Libby", "book_info": "Develop SVG functionality for use within websites quickly and natively, using basic tools such as HTML and CSS. This book is a project-oriented guide to creating and manipulating scalable vector graphics in the browser for websites or online applications, using little more than a text editor or free…"}, {"book_name": "iPad All-in-One For Dummies, 7th Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/iPad-All-in-One-For-Dummies-7th-Edition-400x498.jpg", "book_author": " Nancy C. Muir", "book_info": "5 BOOKS IN 1 Getting Started with iPad Just for Fun iPad on the Go Getting Productive with iWork® Using iPad to Get Organized Your one-stop guide to all things iPad The iPad may be small, but it packs a big punch. Thisall-encompassing guide provides step-by-step guidance for…"}, {"book_name": "Backup & Recovery", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Backup-Recovery.jpg", "book_author": " W. Curtis Preston", "book_info": "Packed with practical, freely available backup and recovery solutions for Unix, Linux, Windows, and Mac OS X systems — as well as various databases — this new guide is a complete overhaul of Unix Backup & Recovery by the same author, now revised and expanded with over 75% new material…."}, {"book_name": "Pro Android with Kotlin", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Pro-Android-with-Kotlin.jpg", "book_author": " Peter Späth", "book_info": "Develop Android apps with Kotlin to create more elegant programs than the Java equivalent. This book covers the various aspects of a modern Android app that professionals are expected to encounter. There are chapters dealing with all the important aspects of the Android platform, including GUI design, file-…"}, {"book_name": "SQL Server 2017 Query Performance Tuning, 5th Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/SQL-Server-2017-Query-Performance-Tuning-5th-Edition.jpg", "book_author": " Grant Fritchey", "book_info": "Identify and fix causes of poor performance. You will learn Query Store, adaptive execution plans, and automated tuning on the Microsoft Azure SQL Database platform. Anyone responsible for writing or creating T-SQL queries will find valuable the insight into bottlenecks, including how to recognize them and eliminate them…."}, {"book_name": "Puppet Best Practices", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Puppet-Best-Practices.jpg", "book_author": " Chris Barbour, Jo Rhett", "book_info": "If you maintain or plan to build Puppet infrastructure, this practical guide will take you a critical step further with best practices for managing the task successfully. Authors Chris Barbour and Jo Rhett present best-in-class design patterns for deploying Puppet environments and discuss the impact of each. The…"}, {"book_name": "Deploying Chromebooks in the Classroom", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Deploying-Chromebooks-in-the-Classroom.jpg", "book_author": " Guy Hart-Davis", "book_info": "Learn how to deploy Chromebook computers in a classroom or lab situation and how to navigate the hardware and software choices you face. This book equips you with the skills and knowledge to plan and execute a deployment of Chromebook computers in the classroom.  Teachers and IT administrators at…"}, {"book_name": "Getting to Know Vue.js", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/09/Getting-to-Know-Vue-js.jpg", "book_author": " Brett Nelson", "book_info": "Learn how to render lists of items without repeating your code structure and how to work with conditional rendering items and event handling. Containing all you need to know to get started with Vue.js, this book will take you through using build tools (transpile to ES5), creating custom…"}, {"book_name": "Professional Android, 4th Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/08/Professional-Android-4th-Edition.jpg", "book_author": " Ian Lake, Reto Meier", "book_info": "The comprehensive developer guide to the latest Android featuresand capabilities Professional Android, 4th Edition shows developers how toleverage the latest features of Android to create robust andcompelling mobile apps. This hands-on approach provides in-depthcoverage through a series of projects, each introducing a newAndroid platform feature and highlighting the techniques…"}, {"book_name": "Deep Learning with Azure", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/08/Deep-Learning-with-Azure.jpg", "book_author": " Danielle Dean, Mathew Salvaris, Wee Hyong Tok", "book_info": "Get up-to-speed with Microsoft’s AI Platform. Learn to innovate and accelerate with open and powerful tools and services that bring artificial intelligence to every data scientist and developer. Artificial Intelligence (AI) is the new normal. Innovations in deep learning algorithms and hardware are happening at a rapid pace…."}, {"book_name": "Getting Started with React", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/08/Getting-Started-with-React-400x500.jpg", "book_author": " Danillo Corvalan, Doel Sengupta, Manu Singhal", "book_info": "ReactJS, popularly known as the V (view) of the MVC architecture, was developed by the Facebook and Instagram developers. It follows a unidirectional data flow, virtual DOM, and DOM difference that are generously leveraged in order to increase the performance of the UI. Getting Started with React will…"}, {"book_name": "Kafka Streams in Action", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/08/Kafka-Streams-in-Action.jpg", "book_author": " Bill Bejeck", "book_info": "Kafka Streams is a library designed to allow for easy stream processing of data flowing into a Kafka cluster. Stream processing has become one of the biggest needs for companies over the last few years as quick data insight becomes more and more important but current solutions can…"}, {"book_name": "Firewalls Don’t Stop Dragons, 3rd Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/08/Firewalls-Dont-Stop-Dragons.jpg", "book_author": " Carey Parker", "book_info": "Rely on this practical, end-to-end guide on cyber safety and online security written expressly for a non-technical audience. You will have just what you need to protect yourself―step by step, without judgment, and with as little jargon as possible. Just how secure is your computer right now? You…"}, {"book_name": "Microsoft BizTalk Server (70-595) Certification and Assessment Guide, Second Edition", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/08/Microsoft-BizTalk-Server-70-595-Certification-and-Assessment-Guide-Second-Edition-400x493.jpg", "book_author": " Johan Hedberg, Kent Weare, Morten la Cour", "book_info": "Microsoft BizTalk Server is an integration and connectivity server solution that enables organizations to easily connect disparate systems. Developing Business Process and Integration Solutions by Using Microsoft BizTalk Server 2010 (70-595) is the certification exam for professionals who need to integrate multiple disparate systems, applications, and data, as…"}, {"book_name": "Asynchronous Android", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/08/Asynchronous-Android-400x493.jpg", "book_author": " Steve Liles", "book_info": "With more than a million apps available from Google Play, it is more important than ever to build apps that stand out from the crowd. To be successful, apps must react quickly to user input, deliver results in a flash, and sync data in the background. Multithreading is…"}, {"book_name": "Practical Video Game Bots", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/08/Practical-Video-Game-Bots.jpg", "book_author": " Ilya Shpigor", "book_info": "Develop and use bots in video gaming to automate game processes and see possible ways to avoid this kind of automation. This book explains how bots can be very helpful in games such as multiplayer online games, both for training your character and for automating repetitious game processes…"}, {"book_name": "Coding All-in-One For Dummies", "book_img_url": "http://www.allitebooks.com/wp-content/uploads/2018/08/Coding-All-in-One-For-Dummies.jpg", "book_author": " Nikhil Abraham", "book_info": "See all the things coding can accomplish The demand for people with coding know-how exceeds the number of people who understand the languages that power technology. Coding All-in-One For Dummies gives you an ideal place to start when you’re ready to add this valuable asset to your professional repertoire. Whether…"}]